{
  "_name_or_path": "aubmindlab/bert-base-arabertv02",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "REPLACE_MT",
    "1": "REPLACE_OD+REPLACE_OG",
    "2": "REPLACE_OH+REPLACE_OM",
    "3": "REPLACE_OD",
    "4": "MERGE-I",
    "5": "REPLACE_MI",
    "6": "REPLACE_OW",
    "7": "REPLACE_OD+REPLACE_OM",
    "8": "REPLACE_OT",
    "9": "REPLACE_O",
    "10": "UC",
    "11": "REPLACE_S",
    "12": "REPLACE_XT",
    "13": "REPLACE_MI+REPLACE_OH",
    "14": "REPLACE_OH+REPLACE_XC",
    "15": "REPLACE_OR",
    "16": "UNK",
    "17": "REPLACE_X",
    "18": "REPLACE_OD+REPLACE_OH",
    "19": "REPLACE_XC+REPLACE_XN",
    "20": "REPLACE_XC",
    "21": "REPLACE_OH+REPLACE_OT",
    "22": "REPLACE_OA",
    "23": "REPLACE_XM",
    "24": "REPLACE_OM+REPLACE_OR",
    "25": "REPLACE_OD+REPLACE_OR",
    "26": "REPLACE_SW",
    "27": "REPLACE_OA+REPLACE_OH",
    "28": "REPLACE_XN",
    "29": "REPLACE_M",
    "30": "REPLACE_OC",
    "31": "REPLACE_OR+REPLACE_OT",
    "32": "REPLACE_OM",
    "33": "REPLACE_OH",
    "34": "REPLACE_SF",
    "35": "REPLACE_XC+REPLACE_XG",
    "36": "REPLACE_OA+REPLACE_OR",
    "37": "REPLACE_XF",
    "38": "MERGE-B",
    "39": "REPLACE_P",
    "40": "SPLIT",
    "41": "DELETE",
    "42": "REPLACE_XG"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "DELETE": 41,
    "MERGE-B": 38,
    "MERGE-I": 4,
    "REPLACE_M": 29,
    "REPLACE_MI": 5,
    "REPLACE_MI+REPLACE_OH": 13,
    "REPLACE_MT": 0,
    "REPLACE_O": 9,
    "REPLACE_OA": 22,
    "REPLACE_OA+REPLACE_OH": 27,
    "REPLACE_OA+REPLACE_OR": 36,
    "REPLACE_OC": 30,
    "REPLACE_OD": 3,
    "REPLACE_OD+REPLACE_OG": 1,
    "REPLACE_OD+REPLACE_OH": 18,
    "REPLACE_OD+REPLACE_OM": 7,
    "REPLACE_OD+REPLACE_OR": 25,
    "REPLACE_OH": 33,
    "REPLACE_OH+REPLACE_OM": 2,
    "REPLACE_OH+REPLACE_OT": 21,
    "REPLACE_OH+REPLACE_XC": 14,
    "REPLACE_OM": 32,
    "REPLACE_OM+REPLACE_OR": 24,
    "REPLACE_OR": 15,
    "REPLACE_OR+REPLACE_OT": 31,
    "REPLACE_OT": 8,
    "REPLACE_OW": 6,
    "REPLACE_P": 39,
    "REPLACE_S": 11,
    "REPLACE_SF": 34,
    "REPLACE_SW": 26,
    "REPLACE_X": 17,
    "REPLACE_XC": 20,
    "REPLACE_XC+REPLACE_XG": 35,
    "REPLACE_XC+REPLACE_XN": 19,
    "REPLACE_XF": 37,
    "REPLACE_XG": 42,
    "REPLACE_XM": 23,
    "REPLACE_XN": 28,
    "REPLACE_XT": 12,
    "SPLIT": 40,
    "UC": 10,
    "UNK": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 64000
}
